## 📖 Terraform Plan - devstream_infra
#### Initialization: `success`
<details><summary>Show Full Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vending_machine["test-devstream-repo"].github_actions_secret.secrets["AZURE_CLIENT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at       = (known after apply)
      + destroy_on_drift = true
      + id               = (known after apply)
      + plaintext_value  = (sensitive value)
      + repository       = "test-devstream-repo"
      + secret_name      = "AZURE_CLIENT_ID"
      + updated_at       = (known after apply)
    }

  # module.vending_machine["test-devstream-repo"].github_actions_secret.secrets["AZURE_STATE_RESOURCE_GROUP"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at       = (known after apply)
      + destroy_on_drift = true
      + id               = (known after apply)
      + plaintext_value  = (sensitive value)
      + repository       = "test-devstream-repo"
      + secret_name      = "AZURE_STATE_RESOURCE_GROUP"
      + updated_at       = (known after apply)
    }

  # module.vending_machine["test-devstream-repo"].github_actions_secret.secrets["AZURE_STATE_STORAGE_ACCOUNT"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at       = (known after apply)
      + destroy_on_drift = true
      + id               = (known after apply)
      + plaintext_value  = (sensitive value)
      + repository       = "test-devstream-repo"
      + secret_name      = "AZURE_STATE_STORAGE_ACCOUNT"
      + updated_at       = (known after apply)
    }

  # module.vending_machine["test-devstream-repo"].github_actions_secret.secrets["AZURE_SUBSCRIPTION_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at       = (known after apply)
      + destroy_on_drift = true
      + id               = (known after apply)
      + plaintext_value  = (sensitive value)
      + repository       = "test-devstream-repo"
      + secret_name      = "AZURE_SUBSCRIPTION_ID"
      + updated_at       = (known after apply)
    }

  # module.vending_machine["test-devstream-repo"].github_actions_secret.secrets["AZURE_TENANT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at       = (known after apply)
      + destroy_on_drift = true
      + id               = (known after apply)
      + plaintext_value  = (sensitive value)
      + repository       = "test-devstream-repo"
      + secret_name      = "AZURE_TENANT_ID"
      + updated_at       = (known after apply)
    }

  # module.vending_machine["test-devstream-repo"].github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Terraform Plan",
            ]
          + strict   = true
        }
    }

  # module.vending_machine["test-devstream-repo"].github_repository.project_repo will be created
  + resource "github_repository" "project_repo" {
      + allow_auto_merge            = true
      + allow_forking               = (known after apply)
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = false
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Infrastructure-as-Code for test-devstream-repo - Managed by DevStream Vending Machine"
      + etag                        = (known after apply)
      + fork                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-devstream-repo"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + source_owner                = (known after apply)
      + source_repo                 = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)

      + template {
          + include_all_branches = false
          + owner                = "iainazure"
          + repository           = "python-ds-template"
        }
    }

  # module.vending_machine["test-devstream-repo"].github_repository_environment.nonprod will be created
  + resource "github_repository_environment" "nonprod" {
      + can_admins_bypass   = true
      + environment         = "nonprod"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "test-devstream-repo"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```
</details>